In [1]:
import oracledb
import pandas as pd

ssh -l nick2003 -L 127.0.0.1:1522:dbhost.students.cs.ubc.ca:1522 remote.students.cs.ubc.ca 

https://www.students.cs.ubc.ca/~cs-368/resources/connecting-to-db.html

In [2]:
dsn = oracledb.makedsn("localhost", 1522, service_name="stu")
connection = oracledb.connect(user="ora_nick2003", password="a45695970", dsn=dsn)

cur = connection.cursor()
# SQL code
for row in cur.execute("select * from titles"):
    print(row)
cur.close()

('PC8888  ', 'Secrets of Silicon Valley', 'popular_comp', '1389', 20, ' 8000.00 ', 4095, '1', "Muckraking reporting on the world's largest computer\nhardware and software manufacturers.", '1985-06-12          ')
('BU1032  ', "The Busy Executive's Database Guide", 'business    ', '1389', 20, ' 5000.00 ', 4095, '1', 'An overview of available database systems with emphasis\n on common business applications.  Illustrated.', '1985-06-12          ')
('PS7777  ', 'Emotional Security: A New Algorithm', 'psychology  ', '0736', 8, ' 4000.00 ', 3336, '1', 'Protecting yourself and your loved ones from undue\n emotional stress in the modern world.\nUse of computer and nutritional aids emphasized.', '1985-06-12          ')
('PS3333  ', 'Prolonged Data Deprivation: Four Case Studies', 'psychology  ', '0736', 20, ' 2000.00 ', 4072, '1', 'What happens when the data runs dry?\nSearching evaluations of information-shortage effects.', '1985-06-12          ')
('BU1111  ', 'Cooking with Computers: Surreptitious Balance Sheets', 'business    ', '1389', 12, ' 5000.00 ', 3876, '1', 'Helpful hints on how to use your electronic resources\nto the best advantage.', '1985-06-09          ')
('MC2222  ', 'Silicon Valley Gastronomic Treats', 'mod_cook    ', '0877', 20, ' 0.00    ', 2032, '1', 'Favorite recipes for quick, easy, and elegant meals tried and\ntested by people who never have time to eat, let alone cook.', '1985-06-09          ')
('TC7777  ', 'Sushi, Anyone?', 'trad_cook   ', '0877', 15, ' 8000.00 ', 4095, '1', 'Detailed instructions on improving your position in life by\nlearning how to make authentic Japanese sushi in your spare time.\n5-10% increase in number of friends per recipe reported from beta test. ', '1985-06-12          ')
('TC4203  ', 'Fifty Years in Buckingham Palace Kitchens', 'trad_cook   ', '0877', 12, ' 4000.00 ', 15096, '1', "More anecdotes from the Queen's favorite cook describing life among\nEnglish royalty.  Recipes, techniques, tender vignettes.", '06/12/85            ')
('PC1035  ', 'But Is It User Friendly?', 'popular_comp', '1389', 23, ' 7000.00 ', 8780, '1', "A survey of software for the naive user, focusing on\nthe 'friendliness' of each.", '06/30/85            ')
('BU2075  ', 'You Can Combat Computer Stress!', 'business    ', '0736', 3, ' 10125.00', 18722, '1', 'The latest medical and psychological techniques for living with\nthe electronic office.  Easy-to-understand explanations.', '06/30/85            ')
('PS2091  ', 'Is Anger the Enemy?', 'psychology  ', '0736', 11, ' 2275.00 ', 2045, '1', 'Carefully researched study of the effects of strong emotions\non the body. Metabolic charts included.', '06/15/85            ')
('PS2106  ', 'Life Without Fear', 'psychology  ', '0736', 7, ' 6000.00 ', 111, '1', 'New exercise, meditation, and nutritional techniques\nthat can reduce the shock of daily interactions. Popular audience.\nSample menus included,exercise video available separately.', '10/05/85            ')
('MC3021  ', 'The Gourmet Microwave', 'mod_cook    ', '0877', 3, ' 15000.00', 22246, '1', 'Traditional French gourmet recipes\nadapted for modern microwave cooking.', '1985-06-18          ')
('TC3218  ', 'Onions, Leeks, and Garlic:\nCooking Secrets of the Mediterranean', 'trad_cook   ', '0877', 21, ' 7000.00 ', 375, '1', 'Profusely illustrated in color, this makes a wonderful\ngift book for a cuisine-oriented friend.', '1985-02-23          ')
('MC3026  ', 'The Psychology of Computer Cooking', None, '0877', None, None, None, '0', None, None)
('BU7832  ', 'Straight Talk About Computers', 'business    ', '1389', 20, ' 5000.00 ', 4095, '1', 'Annotated analysis of what computers can do for you: a no-hype\nguide for the critical user.', '1985-06-22          ')
('PS1372  ', 'Computer Phobic and Non-Phobic Individuals: Behavior Variations', 'psychology  ', '0736', 22, ' 7000.00 ', 375, '1', 'A must for the specialist, this book examines the difference\nbetween those who hate and fear computers and those who think\nthey are swell.', '1985-12-21          ')
('PC9999  ', 'Net Etiquette', 'popular_comp', '1389', None, None, None, '0', 'A must-read for computer conferencing debutantes!.', None)

In [3]:
dsn = oracledb.makedsn("localhost", 1522, service_name="stu")
connection = oracledb.connect(user="ora_nick2003", password="a45695970", dsn=dsn)
cur = connection.cursor()

# Execute SQL query
cur.execute(
"""
SELECT t1.TYPE, SUM(t1.PRICE) 
FROM titles t1
GROUP BY t1.TYPE
"""
)

# Fetch all results
rows = cur.fetchall()

# Get column names from cursor
columns = [desc[0] for desc in cur.description]

# Create DataFrame
df = pd.DataFrame(rows, columns=columns)

cur.execute(
"""
SELECT t1.TYPE, SUM(t1.ADVANCE) 
FROM titles t1
GROUP BY t1.TYPE
"""
)

rows2 = cur.fetchall()
columns2 = [desc[0] for desc in cur.description]
df2 = pd.DataFrame(rows2, columns=columns2)

# Close cursor and connection
cur.close()
connection.close()

# Display DataFrame
display(df)
display(df2)

           TYPE  SUM(T1.PRICE)
0  psychology             68.0
1  trad_cook              48.0
2  popular_comp           43.0
3          None            NaN
4  business               55.0
5  mod_cook               23.0

           TYPE  SUM(T1.ADVANCE)
0  psychology            21275.0
1  trad_cook             19000.0
2  popular_comp          15000.0
3          None              NaN
4  business              25125.0
5  mod_cook              15000.0

In [4]:
dsn = oracledb.makedsn("localhost", 1522, service_name="stu")
connection = oracledb.connect(user="ora_nick2003", password="a45695970", dsn=dsn)
cur = connection.cursor()

# Execute SQL query
cur.execute(
"""
SELECT t1.TYPE, SUM(t1.ADVANCE) 
FROM titles t1
GROUP BY t1.TYPE
"""
)

# Fetch all results
rows = cur.fetchall()

# Get column names from cursor
columns = [desc[0] for desc in cur.description]

# Create DataFrame
df = pd.DataFrame(rows, columns=columns)

# Close cursor and connection
cur.close()
connection.close()

# Display DataFrame
display(df)

           TYPE  SUM(T1.ADVANCE)
0  psychology            21275.0
1  trad_cook             19000.0
2  popular_comp          15000.0
3          None              NaN
4  business              25125.0
5  mod_cook              15000.0